Revit 2027 API
BuiltInFailures.BendFailures.NotBentImport Property
 While making curved beam type "[Type Name]" CAD File elements were not created
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotBentImport { get; }
Public Shared ReadOnly Property NotBentImport As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotBentImport {
	FailureDefinitionId^ get ();
}
static member NotBentImport : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.BendFailures Class
Autodesk.Revit.DB Namespace